posts/2019-07-26-writing-a-background-worker-for-cisco-nso-part-deux.org
#+TITLE: Writing a Python background worker for Cisco NSO - part deux
#+SUBTITLE: Or how Python logging, threading and multiprocessing do not play well
#+AUTHOR: Kristian Larsson
#+EMAIL: kristian@spritelink.net
#+DATE: <2019-07-26 00:00>
#+LANGUAGE: en
#+FILETAGS: NSO
#+OPTIONS: toc:nil num:3 H:4 ^:nil pri:t
#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org.css"/>

* Writing a Python background worker for Cisco NSO - part deux (2)
  We ended the first part with a chunk of code that implements all the functionality we had listed as our requirements. You'll find the code [[https://github.com/plajjan/bgworker/commit/281324399c56f520f99920d00075c9c23557cb1c][in this commit]] in case you want to look at it in more detail and how it then evolved, which is what I'll detail in this post.
  
  First thing I did, after having played around with this code myself for some time, was to hand it over to my colleague Marko. Marko just happened to be implementing an NSO component that needed to run in the background and so he was in need of the background_process design that I had been working on. I couldn't find a better beta tester than Marko, as he was in fact involved in the design of this background worker process pattern and so was familiar with the whole idea but hadn't, up to this point, written any code on it. I expected to get some feedback on if the interface was any good or how documentation was lacking. Instead he comes back saying NSO /hangs/.
  
** Debugging a /hung/ Python VM
   At work we have a rather sleek way of starting up a development environment for NSO. We call it a /playground/ and it consists of one or more containers running NSO and a number of virtual routers or other support containers that together form a small topology. Starting a playground is just a matter of executing one script, waiting a few minutes (both NSO and virtual routers are slow in starting up) and then you can start coding. There are different topologies you can choose from as well as options for controlling persistence of data or restarting playgrounds until tests fail (for finding bug reproduction cases). We start the same topologies in CI for testing. All in all it gives a rather good guarantee that the environment we develop and test in are all uniform.
   
   When Marko said his NSO had hung I was perplexed as it had worked so well for me. We started looking into differences but there were none, or very few. We ran the same playground topology using the same code versions and we were even running it on the same physical machine. Yet mine worked fine, being able to consistently redeploy the bgworker package and his didn't. It was clear we needed to find out what was going on and fix it.
   
   To reproduce the hang, using the bgworker [[https://github.com/plajjan/bgworker/commit/281324399c56f520f99920d00075c9c23557cb1c][as it looked then]] all that is required is to redeploy the package a few times and you are likely to encounter the hang. The background worker would periodically log a message and when it was hung there would simply be no message. We tried adding print statements but it made little difference. We tried to instead write some data to a temporary file but it didn't work.
   
   Increasing the log level to debug from a lower level seemed to increase the likelihood of the hang but we still didn't understand why. We added a stack dumper and a signal handler so when we sent a USR1 signal we would dump the stack to a file which we could inspect to understand what the program was doing. The stack:
   
   #+BEGIN_SRC text
       File "/usr/lib/python3.5/logging/__init__.py", line 1487, in callHandlers
         hdlr.handle(record)

       File "/usr/lib/python3.5/logging/__init__.py", line 853, in handle
         self.acquire()

       File "/usr/lib/python3.5/logging/__init__.py", line 804, in acquire
         self.lock.acquire()
   #+END_SRC
   
   Finally some progress. We repeated this, taking a stack dump for multiple invocations when Python had hung and they all showed the same stack. We were waiting on acquiring a lock!
   
** A ten year old bug
   The stack dump further reveals that the lock is being acquired in the logging module, which simply takes a lock around the output in the handler when it is emitting a log message. I didn't actually know the logging module took locks - mostly because I never thought about how it worked internally - but it's fairly natural since we would otherwise risk two log messages emitted at the same time overwriting each other.
   
   The bgworker uses a mix of logging, threads and multiprocessing. As it turns out, [[https://bugs.python.org/issue6721][there is a bug related to this exact mix]] that Marko found. The bug is ten years old and hadn't yet been fixed.
   
   The multiprocessing module uses fork to create a child process. ~fork()~ works by creating a copy of itself, the running process, so that there are two processes after the ~fork()~ call, one parent and one child process. The child process thus has a copy of all the file handles, sockets and other things in memory.. and if a lock happened to be taken while the child was forked then the lock would be held in both the parent and child, although it is at this time different locks as they had been copied.
   
   Just using multiprocessing and logging is safe since a single threaded program will only do one thing at a time; it will either be logging a message or starting a new child process through fork. As we also mix in the threading module and run multiple threads there is a possibility that we will be forking at the exact moment when a separate thread is logging a message and then the lock will be held! In the parent process the thread emitting a log message will release the lock as soon as it is done but in the child process that never happens since the logging thread isn't running there and the lock is thus held indefinitely. When we then try to log something in the child we first try to acquire the lock but since it is indefinitely held, our Python VM /hangs/.
   
   When bgworker starts up, it is starting multiple threads and forks off the child all around the same time. It also logs quite a few things on startup which means the likelihood of forking while emitting a log message is actually quite high. Raising the log level to debug naturally increases the likelihood even more.
   
   It now also became clear why this hadn't manifested itself for me as I was developing bgworker in a standalone instance whereas Marko was integrating it into a larger package that also ran a number of other threads - also emitting log messages on startup, thus increasing the likelihood of a hang.
   
** Incredible timing
   Note that the version of bgworker that we are talking about was committed on the 5th of July. After that it took us a few days, till the 8th, to hunt this bug down. 8th of July is also the day that Python 3.7.4rc2 was released and 3.7.4rc2 should address this issue!
   
   *We find a bug that is over ten years old and on the day we find it, a fixed version of Python is released. What are the odds?*
   
