posts/2019-07-26-writing-a-background-worker-for-cisco-nso-part-deux.org
** Revamping the NSO docker container
   We run NSO in a docker container so switching Python version is relatively simple, but we still have various components and NEDs that include a couple too many dependencies, which does make it trickier to upgrade. We also try to rely on official packages from the distribution repositories rather than pulling down and compiling our own Python build... but we wanted to make progress, so that had to go out the window.

   Marko and I each rewrote the Dockerfile producing our NSO image, getting multiple alternatives of how we could get a newer Python version in there. We tried pyenv, manual install, some PPA (which wasn't on 3.7.4 yet but we figured we could have waited a few days).

   In the end however, it turns out 3.7.4 doesn't really fix our issue. While it does bring improvements it ultimately does not address our issue. More code would be needed for that (you can't just remove the locks - so trying to log to the same file from what is now two UNIX processes would instead require inter-process locks). Anyway, we needed to fix the real problem through a redesign of our application code.
   
** A fresh start
   The multiprocessing library uses ~fork()~ per default on UNIX like operating systems but this can be influenced through an argument and instead of ~fork()~ we can tell the multiprocessing library to ~spawn~ which I'm pretty sure maps to ~posix_spawn()~ under the hood. Unlike ~fork()~, ~posix_spawn()~ doesn't copy all of the memory of the parent to the child process and so we won't get a copy of the held locks - instead we start off fresh. It also means we don't have any loggers at all so we have to set those up. What we want to provide to the user of our background_process micro-framework is a smooth experience and it's just nice if the loggers are already set up for you so you can focus on your own code instead of overhead stuff like logging.
   
   We wanted to continue using the same log files that NCS uses per default, like ncs-python-vm-bgworker.log, so that the operations aspect remain the same regardless if you are writing standard Python components for NSO or if you are using the backgrund process design. Since we couldn't write to the same log file from two processes we would have to ship the logs from the child process to the parent process which then could write the messages to the file.
   
   Marko quickly put together a queue listener and emitter so we could send log messages over a multiprocessing.Queue. The logging tree in Python is a singleton so we can attach a queue emitting handler in the child process and wrap all this away so that the user of our framework don't have to think about this. We do all this through a wrapping function, like this:
   
   #+BEGIN_SRC python
     def _bg_wrapper(bg_fun, q, log_level, *bg_fun_args):
         """Internal wrapper for the background worker function.
         Used to set up logging via a QueueHandler in the child process. The other end
         of the queue is observed by a QueueListener in the parent process.
         """
         queue_hdlr = logging.handlers.QueueHandler(q)
         root = logging.getLogger()
         root.setLevel(log_level)
         root.addHandler(queue_hdlr)
         logger = logging.getLogger(bg_fun.__name__)
         bg_fun(logger, *bg_fun_args)
   #+END_SRC
   
   The queue log handler is set up and after this we run the bg_function provided to us by the user of the framework.
   
