2019-07-26-writing-a-background-worker-for-cisco-nso-part-deux.html

<div id="outline-container-org796f2df" class="outline-3">
<h3 id="org796f2df"><span class="section-number-3">1.4</span> Revamping the NSO docker container</h3>
<div class="outline-text-3" id="text-1-4">
<p>
We run NSO in a docker container so switching Python version is relatively simple, but we still have various components and NEDs that include a couple too many dependencies, which does make it trickier to upgrade. We also try to rely on official packages from the distribution repositories rather than pulling down and compiling our own Python build&#x2026; but we wanted to make progress, so that had to go out the window.
</p>

<p>
Marko and I each rewrote the Dockerfile producing our NSO image, getting multiple alternatives of how we could get a newer Python version in there. We tried pyenv, manual install, some PPA (which wasn't on 3.7.4 yet but we figured we could have waited a few days).
</p>

<p>
In the end however, it turns out 3.7.4 doesn't really fix our issue. While it does bring improvements it ultimately does not address our issue. More code would be needed for that (you can't just remove the locks - so trying to log to the same file from what is now two UNIX processes would instead require inter-process locks). Anyway, we needed to fix the real problem through a redesign of our application code.
</p>
</div>
</div>

<div id="outline-container-org14bc75f" class="outline-3">
<h3 id="org14bc75f"><span class="section-number-3">1.5</span> A fresh start</h3>
<div class="outline-text-3" id="text-1-5">
<p>
The multiprocessing library uses <code>fork()</code> per default on UNIX like operating systems but this can be influenced through an argument and instead of <code>fork()</code> we can tell the multiprocessing library to <code>spawn</code> which I'm pretty sure maps to <code>posix_spawn()</code> under the hood. Unlike <code>fork()</code>, <code>posix_spawn()</code> doesn't copy all of the memory of the parent to the child process and so we won't get a copy of the held locks - instead we start off fresh. It also means we don't have any loggers at all so we have to set those up. What we want to provide to the user of our background_process micro-framework is a smooth experience and it's just nice if the loggers are already set up for you so you can focus on your own code instead of overhead stuff like logging.
</p>

<p>
We wanted to continue using the same log files that NCS uses per default, like ncs-python-vm-bgworker.log, so that the operations aspect remain the same regardless if you are writing standard Python components for NSO or if you are using the backgrund process design. Since we couldn't write to the same log file from two processes we would have to ship the logs from the child process to the parent process which then could write the messages to the file.
</p>

<p>
Marko quickly put together a queue listener and emitter so we could send log messages over a multiprocessing.Queue. The logging tree in Python is a singleton so we can attach a queue emitting handler in the child process and wrap all this away so that the user of our framework don't have to think about this. We do all this through a wrapping function, like this:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">_bg_wrapper</span><span style="color: #4f97d7;">(</span>bg_fun, q, log_level, *bg_fun_args<span style="color: #4f97d7;">)</span>:
    <span style="color: #9f8766;">"""Internal wrapper for the background worker function.</span>
<span style="color: #9f8766;">    Used to set up logging via a QueueHandler in the child process. The other end</span>
<span style="color: #9f8766;">    of the queue is observed by a QueueListener in the parent process.</span>
<span style="color: #9f8766;">    """</span>
    <span style="color: #7590db;">queue_hdlr</span> = logging.handlers.QueueHandler<span style="color: #4f97d7;">(</span>q<span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">root</span> = logging.getLogger<span style="color: #4f97d7;">()</span>
    root.setLevel<span style="color: #4f97d7;">(</span>log_level<span style="color: #4f97d7;">)</span>
    root.addHandler<span style="color: #4f97d7;">(</span>queue_hdlr<span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">logger</span> = logging.getLogger<span style="color: #4f97d7;">(</span>bg_fun.<span style="color: #4f97d7;">__name__</span><span style="color: #4f97d7;">)</span>
    bg_fun<span style="color: #4f97d7;">(</span>logger, *bg_fun_args<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
The queue log handler is set up and after this we run the bg_function provided to us by the user of the framework.
</p>
</div>
</div>
