posts/2019-07-26-writing-a-background-worker-for-cisco-nso-part-deux.org
** The promise of efficient logging
   Logging can be tricky. We often want to add log messages in various places to easily understand what our program is doing. However, logging itself comes at a cost, not just writing the messages but actually doing the string formatting of them can be relatively expensive. Python's standard logging module is pretty clever and will only format+emit a message if the log level is set high enough. If you have a tight loop and a ~log.debug()~ statement it won't actually run unless the log level is set to debug. This makes it possible to leave the logging statements in your code and know it will normally run fast. You will only incur a performance penalty when you actually turn on debugging.
   
   We can easily show this using a simple program:

   #+BEGIN_SRC python
     #!/usr/bin/env python3

     import logging
     import timeit

     log = logging.getLogger()
     def noop():
         a = 1

     def log_some():
         a = 1
         log.debug("foo")

     if __name__ == '__main__':
         print("Noop                     : {}".format(timeit.timeit(noop, number=100000)))
         log.setLevel(logging.INFO)
         print("Without debug log level  : {}".format(timeit.timeit(log_some, number=100000)))
         log.setLevel(logging.DEBUG)
         print("With debug log level     : {}".format(timeit.timeit(log_some, number=100000)))
         ch = logging.FileHandler('foo.log')
         ch.setLevel(logging.DEBUG)
         log.addHandler(ch)
         print("With debug log level + FH: {}".format(timeit.timeit(log_some, number=100000)))
         log.info("foo")
   #+END_SRC
   
   #+BEGIN_SRC shell
     kll@nuc:~$ python3 slowlog.py 
     Noop                     : 0.005788944661617279
     Without debug log level  : 0.03270535729825497
     With debug log level     : 0.7911096690222621
     With debug log level + FH: 1.8663266659714282
     kll@nuc:~$ 
   #+END_SRC
   
   As we can see, calling a function that doesn't call ~log.debug()~ at all is vastly faster than calling a function that does call ~log.debug()~ - it's roughly an order of magnitude. Then enabling the DEBUG log level makes it roughly an order of magnitude slower and finally, actually writing the messages to a file slows it down to about half the speed.
   
   I think of this as a promise to the programmer. You should be able to put log statements in tight loops that need to run fast (obviously not the tightest of loops - there you simply need to strip out your log statements for running in production). The log calls, when the debug logging isn't enabled, should be very very cheap.
   
   Reconfiguring log levels in NCS will only reconfigure the log handler level in the parent process. The child process will remain oblivious. For us to be able to capture all log messages the child process must therefore always emit all log messages, including debug messages, to the queue and then we can filter them away in the parent process in case the current log level doesn't include debug messages.

   This is however a rather naive implementation design and it breaks the promise of cheap logging. We need to do better.
   
** Log control queue
   To uphold the promise of cheap logging in an environment with multiple processes like ours we need to propagate the log level configuration to the child process so it doesn't need to format and emit the log messages unless enabled by the currently configured logging level.
   
   [[https://github.com/plajjan/bgworker/commit/c6ff59c3e72f152ec9706a97549b389d3c7546e4][I implemented]] a CDB subscriber that listens to changes of the logging configuration and then passes this through a queue to the child process which then reconfigures its logging handler with the appropriate level.
   
   Mission accomplished!
   - No more hangs of the Python VM
   - Consistent logging ergonomics with and without the background process framework
   - Cheap logging calls when debug is disabled

   Read the [[./2019-07-29-writing-a-background-worker-for-cisco-nso-finale.html][final part]] on how to avoid busy polling and efficiently implementing process monitoring!
