2019-07-26-writing-a-background-worker-for-cisco-nso-part-deux.html

<div id="outline-container-org39f679a" class="outline-3">
<h3 id="org39f679a"><span class="section-number-3">1.6</span> The promise of efficient logging</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Logging can be tricky. We often want to add log messages in various places to easily understand what our program is doing. However, logging itself comes at a cost, not just writing the messages but actually doing the string formatting of them can be relatively expensive. Python's standard logging module is pretty clever and will only format+emit a message if the log level is set high enough. If you have a tight loop and a <code>log.debug()</code> statement it won't actually run unless the log level is set to debug. This makes it possible to leave the logging statements in your code and know it will normally run fast. You will only incur a performance penalty when you actually turn on debugging.
</p>

<p>
We can easily show this using a simple program:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">!/usr/bin/env python3</span>

<span style="color: #4f97d7; font-weight: bold;">import</span> logging
<span style="color: #4f97d7; font-weight: bold;">import</span> timeit

<span style="color: #7590db;">log</span> = logging.getLogger<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">noop</span><span style="color: #4f97d7;">()</span>:
    <span style="color: #7590db;">a</span> = <span style="color: #a45bad;">1</span>

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">log_some</span><span style="color: #4f97d7;">()</span>:
    <span style="color: #7590db;">a</span> = <span style="color: #a45bad;">1</span>
    log.debug<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"foo"</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">__name__</span> == <span style="color: #2d9574;">'__main__'</span>:
    <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Noop                     : {}"</span>.<span style="color: #4f97d7;">format</span><span style="color: #bc6ec5;">(</span>timeit.timeit<span style="color: #2d9574;">(</span>noop, number=<span style="color: #a45bad;">100000</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
    log.setLevel<span style="color: #4f97d7;">(</span>logging.INFO<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Without debug log level  : {}"</span>.<span style="color: #4f97d7;">format</span><span style="color: #bc6ec5;">(</span>timeit.timeit<span style="color: #2d9574;">(</span>log_some, number=<span style="color: #a45bad;">100000</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
    log.setLevel<span style="color: #4f97d7;">(</span>logging.DEBUG<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"With debug log level     : {}"</span>.<span style="color: #4f97d7;">format</span><span style="color: #bc6ec5;">(</span>timeit.timeit<span style="color: #2d9574;">(</span>log_some, number=<span style="color: #a45bad;">100000</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">ch</span> = logging.FileHandler<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'foo.log'</span><span style="color: #4f97d7;">)</span>
    ch.setLevel<span style="color: #4f97d7;">(</span>logging.DEBUG<span style="color: #4f97d7;">)</span>
    log.addHandler<span style="color: #4f97d7;">(</span>ch<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"With debug log level + FH: {}"</span>.<span style="color: #4f97d7;">format</span><span style="color: #bc6ec5;">(</span>timeit.timeit<span style="color: #2d9574;">(</span>log_some, number=<span style="color: #a45bad;">100000</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
    log.info<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"foo"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">kll@nuc:~$ python3 slowlog.py 
Noop                     : <span style="color: #a45bad;">0.005788944661617279</span>
Without debug log level  : <span style="color: #a45bad;">0.03270535729825497</span>
With debug log level     : <span style="color: #a45bad;">0.7911096690222621</span>
With debug log level + FH: <span style="color: #a45bad;">1.8663266659714282</span>
kll@nuc:~$ 
</pre>
</div>

<p>
As we can see, calling a function that doesn't call <code>log.debug()</code> at all is vastly faster than calling a function that does call <code>log.debug()</code> - it's roughly an order of magnitude. Then enabling the DEBUG log level makes it roughly an order of magnitude slower and finally, actually writing the messages to a file slows it down to about half the speed.
</p>

<p>
I think of this as a promise to the programmer. You should be able to put log statements in tight loops that need to run fast (obviously not the tightest of loops - there you simply need to strip out your log statements for running in production). The log calls, when the debug logging isn't enabled, should be very very cheap.
</p>

<p>
Reconfiguring log levels in NCS will only reconfigure the log handler level in the parent process. The child process will remain oblivious. For us to be able to capture all log messages the child process must therefore always emit all log messages, including debug messages, to the queue and then we can filter them away in the parent process in case the current log level doesn't include debug messages.
</p>

<p>
This is however a rather naive implementation design and it breaks the promise of cheap logging. We need to do better.
</p>
</div>
</div>

<div id="outline-container-org6e91913" class="outline-3">
<h3 id="org6e91913"><span class="section-number-3">1.7</span> Log control queue</h3>
<div class="outline-text-3" id="text-1-7">
<p>
To uphold the promise of cheap logging in an environment with multiple processes like ours we need to propagate the log level configuration to the child process so it doesn't need to format and emit the log messages unless enabled by the currently configured logging level.
</p>

<p>
<a href="https://github.com/plajjan/bgworker/commit/c6ff59c3e72f152ec9706a97549b389d3c7546e4">I implemented</a> a CDB subscriber that listens to changes of the logging configuration and then passes this through a queue to the child process which then reconfigures its logging handler with the appropriate level.
</p>

<p>
Mission accomplished!
</p>
<ul class="org-ul">
<li>No more hangs of the Python VM</li>
<li>Consistent logging ergonomics with and without the background process framework</li>
<li>Cheap logging calls when debug is disabled</li>
</ul>

<p>
Read the <a href="./2019-07-29-writing-a-background-worker-for-cisco-nso-finale.html">final part</a> on how to avoid busy polling and efficiently implementing process monitoring!
</p>
</div>
</div>
</div>
<div class="taglist"><a href="tags.html">Tags</a>: <a href="tag-nso.html">NSO</a> </div></div>
<div id="postamble" class="status"><br/><div id="archive">
  <a href="/archive.html">Other posts</a>
</div></div>
</body>
</html>
